[
	{
		"created": 1480425907000,
		"id": "235903038",
		"name": "A Hitchhiker's Guide to Developing and Running your own OpenStack using DevStack",
		"status": "upcoming",
		"time": 1485370800000,
		"updated": 1484650489000,
		"utc_offset": 0,
		"waitlist_count": 0,
		"yes_rsvp_count": 19,
		"venue": {
			"id": 24845740,
			"name": "Soho",
			"lat": 51.897701263427734,
			"lon": -8.47553539276123,
			"repinned": false,
			"address_1": "77 Grand Parade",
			"city": "Cork",
			"country": "ie",
			"localized_country_name": "Ireland"
		},
		"group": {
			"created": 1479296500000,
			"name": "OpenStack Cork",
			"id": 21196293,
			"join_mode": "open",
			"lat": 51.900001525878906,
			"lon": -8.470000267028809,
			"urlname": "OpenStack-Cork",
			"who": "Members"
		},
		"link": "https://www.meetup.com/OpenStack-Cork/events/235903038/",
		"description": "<p>So you want to give OpenStack a quick \"test drive\"? Or you have been asked to start contributing to an OpenStack project? Where do you start? How do you even kick off an OpenStack cloud? Stay calm because DevStack is here!</p> <p>Join us if you want to get a walkthrough of “OpenStack in a box” using DevStack. We will show deployment, the underlying system, using and developing on your OpenStack (CLI and Dashboard), and the caveats. This session is a good opportunity to \"cut your teeth\" or \"fine tune your knowledge\" because you tend to set up and destroy DevStack instances quite a number of times throughout your OpenStack career.</p> ",
		"visibility": "public"
	},
	{
		"created": 1482247129000,
		"id": "236354580",
		"name": "OpenStack Identity Service",
		"status": "upcoming",
		"time": 1487271600000,
		"updated": 1483958899000,
		"utc_offset": 0,
		"waitlist_count": 0,
		"yes_rsvp_count": 11,
		"venue": {
			"id": 24845740,
			"name": "Soho",
			"lat": 51.897701263427734,
			"lon": -8.47553539276123,
			"repinned": false,
			"address_1": "77 Grand Parade",
			"city": "Cork",
			"country": "ie",
			"localized_country_name": "Ireland"
		},
		"group": {
			"created": 1479296500000,
			"name": "OpenStack Cork",
			"id": 21196293,
			"join_mode": "open",
			"lat": 51.900001525878906,
			"lon": -8.470000267028809,
			"urlname": "OpenStack-Cork",
			"who": "Members"
		},
		"link": "https://www.meetup.com/OpenStack-Cork/events/236354580/",
		"description": "<p>The OpenStack identity service (code named Keystone) provides a single point of integration for managing authentication, authorization, and service catalog services. Other OpenStack services use the Identity service as a common unified API. Additionally, services that provide information about users but that are not included in OpenStack (such as LDAP services) can be integrated into a pre-existing infrastructure.</p> <p><br/>We are delighted to have Henry Nash as speaker.</p> <p>Some details about Henry:</p> <p><br/>Henry works in IBM's Cloud division as an OpenStack Architect and a core contributor to OpenStack Keystone, driving enterprise capabilities into OpenStack as well as IBM's products that use OpenStack. He has a long history in the creation of enterprise software, having founded 5 venture backed startup companies in Europe and USA, finally coming to IBM via acquisition in 2009. Among the awards these companies have received are both The Queen’s Award for Technology and The Queen’s Award for Export. He holds a 1st class honours degree in Electrical Engineering from the University of Southampton, UK.</p> ",
		"visibility": "public"
	}
]